zephyrproject-rtos/hal_realtek/bee/drivers/adc/src/device/rtl87x2g/rtl_adc.h
/*
 * Copyright (c) 2026, Realtek Semiconductor Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*============================================================================*
 *               Define to prevent recursive inclusion
 *============================================================================*/
#ifndef RTL_ADC_H
#define RTL_ADC_H

#ifdef __cplusplus
extern "C" {
#endif

/*============================================================================*
 *                        Header Files
 *============================================================================*/
#include "utils/rtl_utils.h"
#include "rtl_adc_def.h"
#include "adc_lib.h"

/** \defgroup ADC         ADC
  * \brief
  * \{
  */

/*============================================================================*
 *                         Constants
 *============================================================================*/
/** \defgroup ADC_Exported_Constants ADC Exported Constants
  * \brief
  * \{
  */

/**
 * \defgroup    ADC_Channel_Index ADC Channel Index
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define ADC_Channel_Index_0           0   //!< ADC channel 0.
#define ADC_Channel_Index_1           1   //!< ADC channel 1.
#define ADC_Channel_Index_2           2   //!< ADC channel 2.
#define ADC_Channel_Index_3           3   //!< ADC channel 3.
#define ADC_Channel_Index_4           4   //!< ADC channel 4.
#if (CHIP_ADC_CHANNEL_NUM > 4)
#define ADC_Channel_Index_5           5   //!< ADC channel 5.
#define ADC_Channel_Index_6           6   //!< ADC channel 6.
#define ADC_Channel_Index_7           7   //!< ADC channel 7.
#endif
#if (CHIP_ADC_CHANNEL_NUM > 8)
#define ADC_Channel_Index_8           8   //!< ADC channel 8.
#define ADC_Channel_Index_9           9   //!< ADC channel 9.
#define ADC_Channel_Index_10          10  //!< ADC channel 10.
#define ADC_Channel_Index_11          11  //!< ADC channel 11.
#define ADC_Channel_Index_12          12  //!< ADC channel 12.
#define ADC_Channel_Index_13          13  //!< ADC channel 13.
#define ADC_Channel_Index_14          14  //!< ADC channel 14.
#define ADC_Channel_Index_15          15  //!< ADC channel 15.
#endif
#define IS_ADC_CHANNEL(ch)      ((ch) < CHIP_ADC_CHANNEL_NUM) //!< Specify the maximum ADC channel number.

/** End of ADC_Channel_Index
  * \}
  */

/**
 * \defgroup    ADC_Schedule_Index ADC Schedule Index
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define ADC_Schedule_Index_0          0    //!< ADC schedule index 0.
#define ADC_Schedule_Index_1          1    //!< ADC schedule index 1.
#define ADC_Schedule_Index_2          2    //!< ADC schedule index 2.
#define ADC_Schedule_Index_3          3    //!< ADC schedule index 3.
#define ADC_Schedule_Index_4          4    //!< ADC schedule index 4.
#define ADC_Schedule_Index_5          5    //!< ADC schedule index 5.
#define ADC_Schedule_Index_6          6    //!< ADC schedule index 6.
#define ADC_Schedule_Index_7          7    //!< ADC schedule index 7.
#define ADC_Schedule_Index_8          8    //!< ADC schedule index 8.
#define ADC_Schedule_Index_9          9    //!< ADC schedule index 9.
#define ADC_Schedule_Index_10         10   //!< ADC schedule index 10.
#define ADC_Schedule_Index_11         11   //!< ADC schedule index 11.
#define ADC_Schedule_Index_12         12   //!< ADC schedule index 12.
#define ADC_Schedule_Index_13         13   //!< ADC schedule index 13.
#define ADC_Schedule_Index_14         14   //!< ADC schedule index 14.
#define ADC_Schedule_Index_15         15   //!< ADC schedule index 15.
#if (CHIP_ADC_SCHEDULE_NUM > 16)
#define ADC_Schedule_Index_16         16   //!< ADC schedule index 16.
#define ADC_Schedule_Index_17         17   //!< ADC schedule index 17.
#define ADC_Schedule_Index_18         18   //!< ADC schedule index 18.
#define ADC_Schedule_Index_19         19   //!< ADC schedule index 19.
#endif
#define IS_ADC_SCH_INDEX(IDEX) ((IDEX) < CHIP_ADC_SCHEDULE_NUM) //!< Specify the maximum ADC schedule number.

/** End of ADC_Schedule_Index
  * \}
  */

/**
 * \defgroup    ADC_Schedule_Table ADC Channel and Mode
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define SCHEDULE_TABLE(Index)         (Index) //!< ADC schedule table index.
#define EXT_SINGLE_ENDED(Index)       ((uint16_t)((ADC_MODE_SINGLE_ENDED_VALUE << CHIP_ADC_MODE_OFFSET) | (Index))) //!< External single-ended mode. Index can be  refered to \ref ADC_Channel_Index. 
#define EXT_DIFFERENTIAL(Index)       ((uint16_t)((ADC_MODE_DIFFERENTIAL_VALUE << CHIP_ADC_MODE_OFFSET) | (Index))) //!< External differential mode. Index can be  refered to \ref ADC_Channel_Index.

#define INTERNAL_VBAT_MODE            ((uint16_t)((ADC_MODE_INTERNAL_VALUE << CHIP_ADC_MODE_OFFSET) | 0x00)) //!< Internal VBAT mode.
#if ADC_SUPPORT_VADPIN_MODE
#define INTERNAL_VADPIN_MODE          ((uint16_t)((ADC_MODE_INTERNAL_VALUE << CHIP_ADC_MODE_OFFSET) | 0x01)) //!< Internal VADPIN mode.
#endif


#if ADC_SUPPORT_VADPIN_MODE
#define IS_ADC_SCHEDULE_INDEX_CONFIG(CONFIG) (((CONFIG) & (0xffff << 2 << CHIP_ADC_MODE_OFFSET)) == 0 && \
                                              ((IS_ADC_SCH_INDEX((CONFIG) & (~(0xffff << CHIP_ADC_MODE_OFFSET))) && \
                                                (CONFIG & BIT(CHIP_ADC_MODE_OFFSET + 1) == 0)) || \
                                               (CONFIG) == INTERNAL_VBAT_MODE || \
                                               (CONFIG) == INTERNAL_VADPIN_MODE)) //!< Check if the input parameter is valid.
#else
#define IS_ADC_SCHEDULE_INDEX_CONFIG(CONFIG) (((CONFIG) & (0xffff << 2 << CHIP_ADC_MODE_OFFSET)) == 0 && \
                                              ((IS_ADC_SCH_INDEX((CONFIG) & (~(0xffff << CHIP_ADC_MODE_OFFSET))) && \
                                                (CONFIG & BIT(CHIP_ADC_MODE_OFFSET + 1) == 0)) || \
                                               (CONFIG) == INTERNAL_VBAT_MODE)) //!< Check if the input parameter is valid.
#endif

/** End of ADC_Schedule_Table
  * \}
  */

/**
 * \defgroup    ADC_Convert_Time ADC Convert Time
 * \{
 * \ingroup     ADC_Exported_Constants
 */
typedef enum
{
    ADC_CONVERT_TIME_500NS,  //!< ADC Convert time is 500ns.
    ADC_CONVERT_TIME_700NS,  //!< ADC Convert time is 700ns.
    ADC_CONVERT_TIME_900NS,  //!< ADC Convert time is 900ns.
    ADC_CONVERT_TIME_1100NS, //!< ADC Convert time is 1100ns.
} ADCConvertTim_TypeDef;

#define IS_ADC_CONVERT_TIME(TIME) (((TIME) == ADC_CONVERT_TIME_500NS) || \
                                   ((TIME) == ADC_CONVERT_TIME_700NS) || \
                                   ((TIME) == ADC_CONVERT_TIME_900NS) || \
                                   ((TIME) == ADC_CONVERT_TIME_1100NS)) //!< Check if the input parameter is valid.

/** End of ADC_Convert_Time
  * \}
  */

/**
 * \defgroup    ADC_Latch_Data_Edge ADC Latch Data Edge
 * \{
 * \ingroup     ADC_Exported_Constants
 */
typedef enum
{
    ADC_LATCH_DATA_Positive, //!< ADC latch data at positive clock edge.
    ADC_LATCH_DATA_Negative, //!< ADC latch data at negative clock edge.
} ADCDataLatchEdge_TypeDef;

#define IS_ADC_LATCH_MODE(MODE) (((MODE) == ADC_LATCH_DATA_Positive) || ((MODE) == ADC_LATCH_DATA_Negative)) //!< Check if the input parameter is valid.

