zephyrproject-rtos/hal_realtek/bee/drivers/adc/src/device/rtl87x2g/rtl_adc.h
/** End of ADC_Latch_Data_Edge
  * \}
  */

/**
 * \defgroup    ADC_Data_Align ADC Data Align
 * \{
 * \ingroup     ADC_Exported_Constants
 */
typedef enum
{
    ADC_DATA_ALIGN_LSB, //!< ADC data storage format is LSB.
    ADC_DATA_ALIGN_MSB, //!< ADC data storage format is MSB.
} ADCAlign_TypeDef;

#define IS_ADC_DATA_ALIGN(DATA_ALIGN) (((DATA_ALIGN) == ADC_DATA_ALIGN_LSB) || ((DATA_ALIGN) == ADC_DATA_ALIGN_MSB)) //!< Check if the input parameter is valid.

/** End of ADC_Data_Align
  * \}
  */

/**
 * \defgroup    ADC_Raw_Data_Average ADC Raw Data Average
 * \{
 * \ingroup     ADC_Exported_Constants
 */
typedef enum
{
    ADC_DATA_AVERAGE_OF_2,    //!< 2 data used to calculate average.
    ADC_DATA_AVERAGE_OF_4,    //!< 4 data used to calculate average.
    ADC_DATA_AVERAGE_OF_8,    //!< 8 data used to calculate average.
    ADC_DATA_AVERAGE_OF_16,   //!< 16 data used to calculate average.
    ADC_DATA_AVERAGE_OF_32,   //!< 32 data used to calculate average.
    ADC_DATA_AVERAGE_OF_64,   //!< 64 data used to calculate average.
    ADC_DATA_AVERAGE_OF_128,  //!< 128 data used to calculate average.
    ADC_DATA_AVERAGE_OF_256,  //!< 256 data used to calculate average.
    ADC_DATA_AVERAGE_MAX,     //!< The largest enumeration value.
} ADCDataAvgSel_TypeDef;

#define IS_ADC_DATA_AVG_NUM(NUM) (((NUM) == ADC_DATA_AVERAGE_OF_2) || \
                                  ((NUM) == ADC_DATA_AVERAGE_OF_4) || \
                                  ((NUM) == ADC_DATA_AVERAGE_OF_8) || \
                                  ((NUM) == ADC_DATA_AVERAGE_OF_16) || \
                                  ((NUM) == ADC_DATA_AVERAGE_OF_32) || \
                                  ((NUM) == ADC_DATA_AVERAGE_OF_64) || \
                                  ((NUM) == ADC_DATA_AVERAGE_OF_128) || \
                                  ((NUM) == ADC_DATA_AVERAGE_OF_256)) //!< Check if the input parameter is valid.

/** End of ADC_Data_Average
  * \}
  */


/**
 * \defgroup    ADC_FIFO_Threshold ADC FIFO Threshold
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define IS_ADC_FIFO_THRESHOLD(THD) ((THD) <= 0x3F) //!< ADC FIFO threshold is between 0 and 0x3F.

/** End of ADC_FIFO_Threshold
  * \}
  */

/**
 * \defgroup    ADC_Burst_Size ADC Burst Size
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define IS_ADC_BURST_SIZE_CONFIG(CONFIG) ((CONFIG) <= 0x3F) //!< ADC burst size is between 0 and 0x3F.

/** End of ADC_Burst_Size
  * \}
  */

/**
 * \defgroup    ADC_Operation_Mode ADC Operation Mode
 * \{
 * \ingroup     ADC_Exported_Constants
 */
typedef enum
{
    ADC_CONTINUOUS_MODE, //!< ADC continuous mode.
    ADC_ONE_SHOT_MODE,   //!< ADC one shot mode.
} ADCOperationMode_TypeDef;

#define IS_ADC_MODE(MODE) (((MODE) == ADC_CONTINUOUS_MODE) || ((MODE) == ADC_ONE_SHOT_MODE)) //!< Check if the input parameter is valid.

/** End of ADC_Operation_Mode
  * \}
  */

/**
 * \defgroup    ADC_Power_Mode  ADC Power Mode
 * \{
 * \ingroup     ADC_Exported_Constants
 */
typedef enum
{
    ADC_POWER_ON_AUTO,     //!< The power mode of ADC is auto mode.
    ADC_POWER_ON_MANUAL,   //!< The power mode of ADC is manual mode.
} ADCPowerMode_TypeDef;

#define IS_ADC_POWER_MODE(MODE) (((MODE) == ADC_POWER_ON_AUTO) || ((MODE) == ADC_POWER_ON_MANUAL)) //!< Check if the input parameter is valid.

/** End of ADC_Power_Mode
  * \}
  */

/**
 * \defgroup    ADC_Interrupts_Definition ADC Interrupts Definition
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define ADC_INT_FIFO_RD_REQ           ((uint32_t)(1 << 0)) //!< ADC GDMA request interrupt. When FIFO data level achieve the GDMA threshold level (ADC_WaterLevel), this interrupt is triggered.
#define ADC_INT_FIFO_RD_ERR           ((uint32_t)(1 << 1)) //!< ADC FIFO read error interrupt. When read the empty FIFO, this interrupt is triggered.
#define ADC_INT_FIFO_THD              ((uint32_t)(1 << 2)) //!< ADC FIFO threshold interrupt. When FIFO data number is more than or equal to the threshold level (ADC_FifoThdLevel), this interrupt is triggered.
#if ADC_SUPPORT_INT_FIFO_FULL
#define ADC_INT_FIFO_FULL             ((uint32_t)(1 << 3)) //!< ADC FIFO full interrupt. When FIFO full, this interrupt is triggered.
#else
#define ADC_INT_FIFO_OVERFLOW         ((uint32_t)(1 << 3)) //!< ADC FIFO overflow interrupt. When FIFO overflow, this interrupt is triggered.
#endif
#define ADC_INT_ONE_SHOT_DONE         ((uint32_t)(1 << 4)) //!< ADC one shot mode done interrupt. When ADC conversion done, this interrupt is triggered.
#if ADC_SUPPORT_INT_FIFO_FULL
#define ADC_INT_FIFO_OVERFLOW         ((uint32_t)(1 << 5)) //!< ADC FIFO overflow interrupt. When FIFO overflow, this interrupt is triggered.
#endif

#if ADC_SUPPORT_INT_FIFO_FULL
#define IS_ADC_INT(INT) (((INT) == ADC_INT_FIFO_RD_REQ) || \
                         ((INT) == ADC_INT_FIFO_RD_ERR) || \
                         ((INT) == ADC_INT_FIFO_THD) || \
                         ((INT) == ADC_INT_FIFO_OVERFLOW) || \
                         ((INT) == ADC_INT_ONE_SHOT_DONE) || \
                         ((INT) == ADC_INT_FIFO_FULL))     //!< Check if the input parameter is valid.
#else
#define IS_ADC_INT(INT) (((INT) == ADC_INT_FIFO_RD_REQ) || \
                         ((INT) == ADC_INT_FIFO_RD_ERR) || \
                         ((INT) == ADC_INT_FIFO_THD) || \
                         ((INT) == ADC_INT_FIFO_OVERFLOW) || \
                         ((INT) == ADC_INT_ONE_SHOT_DONE)) //!< Check if the input parameter is valid.
#endif

/** End of ADC_Interrupts_Definition
  * \}
  */

#if (ADC_SUPPORT_RAP_FUNCTION == 1)

/**
 * \defgroup    ADC_Qactive_Force TIM Qactive Force
 * \{
 * \ingroup     ADC_Exported_Constants
 */
typedef enum
{
    ADC_QACTIVE_FW_SCLK_FORCE = 0x0,
    ADC_QACTIVE_FW_PCLK_FORCE = 0x1,
    ADC_QACTIVE_FW_PCLK_ICG = 0x1,
} ADCQactiveForce_TypeDef;

/** End of ADC_Qactive_Force
  * \}
  */

/**
 * \defgroup    ADC_Task TIM Task
 * \{
 * \ingroup     ADC_Exported_Constants
 */
typedef enum
{
    ADC_TASK_ONE_SHOT_SAMPLE = 0,
} ADCTask_TypeDef;

/** End of ADC_Task
  * \}
  */

#endif


/** End of ADC_Exported_Constants
  * \}
  */

