zephyrproject-rtos/hal_realtek/bee/drivers/adc/src/device/rtl87x2g/rtl_adc.h
/*============================================================================*
 *                         Types
 *============================================================================*/
/** \defgroup ADC_Exported_Types ADC Exported Types
  * \brief
  * \{
  */

/**
 * \brief       ADC init structure definition.
 *
 * \ingroup     ADC_Exported_Types
 */
typedef struct
{
    uint16_t ADC_SampleTime;                /*!< Specify the ADC Sample clock. (ADC_SampleTime+1) cycles of 10MHz.
                                                 This parameter can be a value of 19 to 16383. */

    ADCConvertTim_TypeDef ADC_ConvertTime;  /**< Specify the ADC Sample convert time.
                                                 This parameter can be a value of \ref ADC_Convert_Time. */

    FunctionalState ADC_DataWriteToFifo;    /*!< Write ADC one shot mode data into FIFO.
                                                 This parameter can be a value of DISABLE or ENABLE. */

    uint8_t ADC_FifoThdLevel;               /*!< Specify the ADC FIFO threshold to trigger interrupt ADC_INT_FIFO_TH.
                                                 This parameter can be a value of 0 to 31. */

    uint8_t ADC_WaterLevel;                 /*!< Specify the ADC FIFO Burst Size to trigger GDMA.
                                                 This parameter can be a value of 0 to 31. */

    FunctionalState ADC_FifoOverWriteEn;    /*!< Specify if over write FIFO when FIFO overflow.
                                                 This parameter can be a value of DISABLE or ENABLE. */

#if ADC_SUPPORT_DMA_EN
    FunctionalState ADC_DmaEn;              /*!< Enable or disable the DMA function of ADC.
                                                 This parameter can be a value of DISABLE or ENABLE. */
#endif

    uint16_t ADC_SchIndex[CHIP_ADC_SCHEDULE_NUM]; /*!< Specify ADC mode and channel for schedule table.*/

    uint32_t ADC_Bitmap;                    /*!< Specify the schedule table channel map.
                                                 This parameter can be a value of 16Bits map. */

    FunctionalState ADC_TimerTriggerEn;     /*!< Enable or disable ADC one-shot mode when tim7 toggles.
                                                 This parameter can be a value of DISABLE or ENABLE. */

    ADCAlign_TypeDef ADC_DataAlign;         /*!< ADC Data MSB or LSB aligned.
                                                 This parameter can be a value of \ref ADC_Data_Align. */

    FunctionalState ADC_DataMinusEn;        /**< Enable or disable function that adc data latched
                                                 minus the given offset before writes to reg/FIFO. */

    uint16_t ADC_DataMinusOffset;           /**< Offset to be minused from adc data latched.
                                                 This parameter can be a value of 0 to 4095. */

    ADCDataAvgSel_TypeDef ADC_DataAvgSel;   /**< Number of data for calculate average.
                                                 This parameter can be a value of \ref ADC_Raw_Data_Average. */

    uint8_t ADC_DataAvgEn;                  /**< Enable or disable the calculation for average result of the one shot data.
                                                 This parameter can be a value of DISABLE or ENABLE. */

    uint8_t ADC_DataLatchDly;               /*!< Specify specify the number of the beginning data from ADC output to be discarded. */

    FunctionalState ADC_FifoStopWriteEn;    /*!< Stop fifo from writing data. This bit will be asserted
                                                 automatically as fifo overflow, (not automatically when
                                                 ADC_FIFO_OVER_WRITE_ENABLE), need to be cleared in order
                                                 to write data again. This will not stop overwrite mode. */

    ADCPowerMode_TypeDef ADC_PowerOnMode;   /**< Specify ADC power on mode.
                                                 This parameter can be a value of \ref ADC_Power_Mode. */

    FunctionalState ADC_PowerAlwaysOnEn;    /*!< Enable or disable the power always on.
                                                 This parameter can be a value of DISABLE or ENABLE. */

#if ADC_SUPPORT_POWER_ON_DELAY
    FunctionalState ADC_PowerOnDlyEn;       /*!< Enable or disable ADC 8ms delay after adc power on.
                                                 This parameter can be a value of DISABLE or ENABLE. */
#endif
} ADC_InitTypeDef;

/** End of ADC_Exported_Types
  * \}
  */

/*============================================================================*
 *                         Functions
 *============================================================================*/
/** \defgroup ADC_Exported_Functions ADC Exported Functions
  * \brief
  * \{
  */

/**
 * \brief   Deinitialize the ADC peripheral registers to their
 *          default reset values(turn off ADC clock).
 *
 * \param[in] ADCx  Specify ADC peripheral, can only be ADC.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_adc_init(void)
 * {
 *     //Turn off the clock.
 *     ADC_DeInit(ADC);
 * }
 * \endcode
 */
void ADC_DeInit(ADC_TypeDef *ADCx);

/**
 * \brief Initialize the ADC peripheral according to the specified parameters in the ADC_InitStruct
 *
 * \param[in]  ADCx            Select ADC peripheral.
 * \param[in]  ADC_InitStruct  Pointer to a ADC_InitTypeDef structure which will be initialized.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_adc_init(void)
 * {
 *     //Turn on the clock.
 *     RCC_PeriphClockCmd(APBPeriph_ADC, APBPeriph_ADC_CLOCK, ENABLE);

 *     ADC_InitTypeDef ADC_InitStruct;
 *     ADC_StructInit(&ADC_InitStruct);
 *     ADC_InitStruct.ADC_SchIndex[0] = EXT_SINGLE_ENDED(0);
 *     ADC_InitStruct.ADC_SchIndex[1] = EXT_SINGLE_ENDED(1);
 *     ADC_InitStruct.ADC_Bitmap = 0x03;
 *     //Add other initialization parameters that need to be configured here.
 *     ADC_Init(ADC, &ADC_InitStruct);
 * }
 * \endcode
 */
void ADC_Init(ADC_TypeDef *ADCx, ADC_InitTypeDef *ADC_InitStruct);

/**
 * \brief   Fill each ADC_InitStruct member with its default value.
 *
 * \note   The default settings for the ADC_InitStruct member are shown in the following table:
 *         | ADC_InitStruct member   | Default value                   |
 *         |:-----------------------:|:-------------------------------:|
 *         | ADC_SampleTime          | 0x3E7                           |
 *         | ADC_ConvertTime         | \ref ADC_CONVERT_TIME_500NS     |
 *         | ADC_DataWriteToFifo     | DISABLE                         |
 *         | ADC_FifoThdLevel        | 0x06                            |
 *         | ADC_WaterLevel          | 0x1                             |
 *         | ADC_FifoOverWriteEn     | ENABLE                          |
 *         | ADC_SchIndex[16]        | 0                               |
 *         | ADC_Bitmap              | 0x0                             |
 *         | ADC_TimerTriggerEn      | DISABLE                         |
 *         | ADC_DataAlign           | \ref ADC_DATA_ALIGN_LSB         |
 *         | ADC_DataMinusEn         | DISABLE                         |
 *         | ADC_DataMinusOffset     | 0                               |
 *         | ADC_FifoStopWriteEn     | DISABLE                         |
 *         | ADC_DataAvgEn           | DISABLE                         |
 *         | ADC_DataAvgSel          | \ref ADC_DATA_AVERAGE_OF_2      |
 *         | ADC_PowerAlwaysOnEn     | DISABLE                         |
 *         | ADC_DataLatchDly        | 0x1                             |
 *         | ADC_PowerOnDlyEn        | DISABLE                         |
 *
 * \param[in] ADC_InitStruct  Pointer to an ADC_InitTypeDef structure which will be initialized.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_adc_init(void)
 * {
 *     //Turn on the clock.
 *     RCC_PeriphClockCmd(APBPeriph_ADC, APBPeriph_ADC_CLOCK, ENABLE);

