zephyrproject-rtos/hal_realtek/bee/drivers/adc/src/device/rtl87x2g/rtl_adc.h
 *     ADC_InitTypeDef ADC_InitStruct;
 *     ADC_StructInit(&ADC_InitStruct);
 *     ADC_InitStruct.ADC_SchIndex[0] = EXT_SINGLE_ENDED(0);
 *     ADC_InitStruct.ADC_SchIndex[1] = EXT_SINGLE_ENDED(1);
 *     ADC_InitStruct.ADC_Bitmap = 0x03;
 *     //Add other initialization parameters that need to be configured here.
 *     ADC_Init(ADC, &ADC_InitStruct);
 * }
 * \endcode
 * \callgraph
 *
 */
void ADC_StructInit(ADC_InitTypeDef *ADC_InitStruct);

/**
 * \brief   Enable or disable the ADC peripheral.
 *
 * \param[in] ADCx      Specify ADC peripheral.
 * \param[in] AdcMode   ADC operation mode selection.
 *                      This parameter can be one of the following values:
 *                      \arg ADC_ONE_SHOT_MODE: One shot mode.
 *                      \arg ADC_CONTINUOUS_MODE: Continuous sampling mode.
 * \param[in] NewState  New state of the ADC peripheral.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Enable the specified ADC peripheral.
 *                      - DISABLE: Disable the specified ADC peripheral.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_adc_init(void)
 * {
 *     Pad_Config(P2_0, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE,
 *                PAD_OUT_LOW);
 *
 *     Pad_Config(P2_1, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE,
 *                PAD_OUT_LOW);
 * }
 *
 * void driver_adc_init(void)
 * {
 *     //open clock
 *     RCC_PeriphClockCmd(APBPeriph_ADC, APBPeriph_ADC_CLOCK, ENABLE);
 *
 *     ADC_InitTypeDef ADC_InitStruct;
 *     ADC_StructInit(&ADC_InitStruct);
 *     ADC_InitStruct.ADC_SchIndex[0] = EXT_SINGLE_ENDED(0);
 *     ADC_InitStruct.ADC_SchIndex[1] = EXT_SINGLE_ENDED(1);
 *     ADC_InitStruct.ADC_Bitmap = 0x03;
 *     //Add other initialization parameters here.
 *     ADC_Init(ADC, &ADC_InitStruct);
 *
 *     ADC_INTConfig(ADC, ADC_INT_ONE_SHOT_DONE, ENABLE);
 * }
 *
 * void adc_demo(void)
 * {
 *     board_adc_init();
 *     driver_adc_init();
 *     ADC_Cmd(ADC, ADC_ONE_SHOT_MODE, ENABLE);
 * }
 * \endcode
 */
void ADC_Cmd(ADC_TypeDef *ADCx, ADCOperationMode_TypeDef AdcMode, FunctionalState NewState);

/**
 * \brief   Enable or disable the specified ADC interrupts.
 *
 * \param[in] ADCx      Specify ADC peripheral.
 * \param[in] ADC_IT    Specify the ADC interrupts sources to be enabled or disabled.
 *                      This parameter can be any combination of the following values.
 *                      Refer to \ref ADC_Interrupts_Definition.
 *                      \arg ADC_INT_FIFO_RD_REQ : FIFO read request.
 *                      \arg ADC_INT_FIFO_RD_ERR : FIFO read error.
 *                      \arg ADC_INT_FIFO_THD : ADC FIFO size > thd.
 *                      \arg ADC_INT_FIFO_OVERFLOW : ADC FIFO overflow.
 *                      \arg ADC_INT_ONE_SHOT_DONE : ADC one shot mode done.
 * \param[in] NewState  New state of the specified ADC interrupt.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Enable the specified ADC interrupts.
 *                      - DISABLE: Disable the specified ADC interrupts.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_adc_init(void)
 * {
 *     //open clock
 *     RCC_PeriphClockCmd(APBPeriph_ADC, APBPeriph_ADC_CLOCK, ENABLE);
 *
 *     ADC_InitTypeDef ADC_InitStruct;
 *     ADC_StructInit(&ADC_InitStruct);
 *     ADC_InitStruct.ADC_SchIndex[0] = EXT_SINGLE_ENDED(0);
 *     ADC_InitStruct.ADC_SchIndex[1] = EXT_SINGLE_ENDED(1);
 *     ADC_InitStruct.ADC_Bitmap = 0x03;
 *     //Add other initialization parameters here.
 *     ADC_Init(ADC, &ADC_InitStruct);
 *
 *     ADC_INTConfig(ADC, ADC_INT_FIFO_RD_ERR, ENABLE);
 *     ADC_INTConfig(ADC, ADC_INT_ONE_SHOT_DONE, ENABLE);
 * }
 * \endcode
 *
 */
void ADC_INTConfig(ADC_TypeDef *ADCx, uint32_t ADC_INT, FunctionalState NewState);

/**
 * \brief      Read ADC data according to specific channel.
 *
 * \param[in]  ADCx   Specify ADC peripheral.
 * \param[in]  Index  Can be 0 to 15.
 *
 * \return     The 12-bit converted ADC raw data.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void adc_demo(void)
 * {
 *     board_adc_init();
 *     driver_adc_init();
 *     ADC_Cmd(ADC, ADC_ONE_SHOT_MODE, ENABLE);
 *     while(ADC_GetINTStatus(ADC, ADC_INT_ONE_SHOT_DONE) == RESET);
 *     uint16_t raw_data_0 = ADC_ReadRawData(ADC, 0);
 *     uint16_t raw_data_1 = ADC_ReadRawData(ADC, 1);
 * }
 * \endcode
 */
uint16_t ADC_ReadRawData(ADC_TypeDef *ADCx, uint8_t Index);

/**
 * \brief   Get ADC average data from ADC schedule table0.
 *
 * \param[in]  ADCx  Specify ADC peripheral.
 *
 * \return  The 12-bit converted ADC raw data.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void adc_demo(void)
 * {
 *     board_adc_init();
 *     driver_adc_init();
 *     ADC_Cmd(ADC, ADC_ONE_SHOT_MODE, ENABLE);
 *     while(ADC_GetINTStatus(ADC, ADC_INT_ONE_SHOT_DONE) == RESET);
 *     uint16_t raw_data = 0;
 *     raw_data = ADC_ReadAvgRawData(ADC);
 * }
 * \endcode
 *
 */
uint16_t ADC_ReadAvgRawData(ADC_TypeDef *ADCx);

/**
 * \brief  Read one byte data from ADC FIFO.
 *
 * \param[in]  ADCx  Select ADC peripheral.
 *
 * \return ADC FIFO data.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void adc_demo(void)
 * {
 *     board_adc_init();
 *     driver_adc_init();
 *     ADC_Cmd(ADC, ADC_ONE_SHOT_MODE, ENABLE);
 *     while(ADC_GetINTStatus(ADC, ADC_INT_ONE_SHOT_DONE) == RESET);
 *     uint16_t raw_data = 0;
 *     raw_data = ADC_ReadFIFO(ADC);
 * }
 * \endcode
 */
uint16_t ADC_ReadFIFO(ADC_TypeDef *ADCx);

/**
 * \brief   Get data from ADC FIFO.
 *
 * \param[in]  ADCx    Specify ADC peripheral.
 * \param[out] outBuf  Buffer to save data read from ADC FIFO.
 * \param[in]  Num     Number of data to be read.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void adc_demo(void)
 * {
 *     //ADC already start
 *     uint16_t raw_data[32] = {0};
 *     uint8_t data_len = ADC_GetFIFODataLen(ADC);
 *     ADC_ReadFIFOData(ADC,raw_data,data_len);
 * }
 * \endcode
 *
 */
void ADC_ReadFIFOData(ADC_TypeDef *ADCx, uint16_t *outBuf, uint16_t Num);

/**
 * \brief   Get ADC FIFO data number.
 *
 * \param[in] ADCx  Select ADC peripheral.
 *
 * \return  Current data number in ADC FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void adc_demo(void)
 * {
 *     //ADC already start
 *     uint16_t raw_data[32] = {0};
 *     uint8_t data_len = ADC_GetFIFODataLen(ADC);
 *     ADC_ReadFIFOData(ADC,raw_data,data_len);
 * }
 * \endcode
 *
 */
uint8_t ADC_GetFIFODataLen(ADC_TypeDef *ADCx);

/**
 * \brief   Config ADC schedule table.
 *
 * \param[in] ADCx     Specify ADC peripheral.
 * \param[in] AdcMode  ADC operation mode.
 *                     This parameter can be one of the following values:
 *                     \arg EXT_SINGLE_ENDED(index): Single-ended mode, the input is external channel index.
 *                     \arg EXT_DIFFERENTIAL(index): Differential mode, the positive input is external channel index,
 *                     the negative input external channel index1.
 *                     \arg INTERNAL_VBAT_MODE: The input is internal battery voltage detection channel.
 * \param[in] Index:   Schedule table index.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void adc_demo(void)
 * {
 *     ADC_SchIndexConfig(ADC,INTERNAL_VBAT_MODE,0);
 * }
 * \endcode
 *
 */
void ADC_SchIndexConfig(ADC_TypeDef *ADCx, uint8_t AdcMode, uint16_t Index);

/**
 * \brief   Config ADC bit map.
 *
 * \param[in]  ADCx      Specify ADC peripheral.
 * \param[in]  BitMap    ADC bit map.
 * \param[in]  NewState  New state of the ADC peripheral.
 *                       This parameter can be one of the following values:
 *                       - ENABLE: Enable ADC bit map.
 *                       - DISABLE: Disable ADC bit map.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void adc_demo(void)
 * {
 *     uint16_t bit_map = 0x03;
 *     ADC_BitMapConfig(ADC,bit_map);
 * }
 * \endcode
 */
void ADC_BitMapConfig(ADC_TypeDef *ADCx, uint16_t BitMap);

/**
 * \brief   Enbale or disable write data to FIFO.
 *
 * \param[in] ADCx      Specify ADC peripheral.
 * \param[in] NewState  New state of the ADC FIFO write.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Enable the stop of FIFO writing data.
 *                      - DISABLE: Disable the stop of FIFO writing data.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void adc_demo(void)
 * {
 *     ADC_WriteFIFOCmd(ADC, ENABLE);
 * }
 * \endcode
 */
void ADC_WriteFIFOCmd(ADC_TypeDef *ADCx, FunctionalState NewState);

/**
 * \brief     Config ADC bypass resistor.
 *
 * \param[in] channelNum  External channel number, can be 0~7.
 * \param[in] NewState    Specify whether the channel enables bypass mode.
 *                        This parameter can be one of the following values:
 *                        - ENABLE: Enable ADC bypass function.
 *                        - DISABLE: Disable ADC bypass function.
 *
 * \attention The input voltage of channel pin using bypass mode cannot exceed 0.9V!
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void adc_demo(void)
 * {
 *     ADC_BypassCmd(0,ENABLE);
 * }
 * \endcode
 */
void ADC_BypassCmd(uint8_t ChannelNum, FunctionalState NewState);

/**
 * \brief  Get the specified ADC interrupt flag status.
 *
 * \param[in]  ADCx          Select ADC peripheral.
 * \param[in]  ADC_INT_FLAG  Specify the interrupt flag to check.
 *                           This parameter can be one of the following values.
 *                           Refer to \ref ADC_Interrupts_Definition.
 *                           \arg ADC_INT_ONE_SHOT_DONE: ADC once convert end interrupt.
 *                           \arg ADC_INT_FIFO_OVERFLOW: ADC FIFO overflow interrupt.
 *                           \arg ADC_INT_FIFO_THD: FIFO larger than threshold interrupt.
 *                           \arg ADC_INT_FIFO_RD_ERR: ADC read FIFO error interrupt.
 *                           \arg ADC_INT_FIFO_RD_REQ: ADC read FIFO request interrupt.
 *
 * \return The status of ADC interrupt.
 *         - SET: The ADC interrupt status is set.
 *         - RESET: The ADC interrupt status is reset.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void adc_demo(void)
 * {
 *     ITStatus int_status = RESET;
 *     int_status = ADC_GetINTStatus(ADC,ADC_INT_FIFO_OVERFLOW);
 * }
 * \endcode
 */
ITStatus ADC_GetINTStatus(ADC_TypeDef *ADCx, uint32_t ADC_INT);

/**
 * \brief  Clear the ADC interrupt pending bit.
 *
 * \param[in] ADCx     Specify ADC peripheral.
 * \param[in] ADC_INT  Specify the interrupt pending bit to clear.
 *                     This parameter can be any combination of the following values.
 *                     Refer to \ref ADC_Interrupts_Definition.
 *                     - ADC_INT_ONE_SHOT_DONE: ADC once convert end interrupt.
 *                     - ADC_INT_FIFO_OVERFLOW: ADC FIFO overflow interrupt.
 *                     - ADC_INT_FIFO_THD: FIFO larger than threshold interrupt.
 *                     - ADC_INT_FIFO_RD_ERR: ADC read FIFO error interrupt.
 *                     - ADC_INT_FIFO_RD_REQ: ADC read FIFO request interrupt.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void adc_demo(void)
 * {
 *     ADC_ClearINTPendingBit(ADC,ADC_INT_FIFO_OVERFLOW);
 * }
 * \endcode
 */
void ADC_ClearINTPendingBit(ADC_TypeDef *ADCx, uint32_t ADC_INT);

/**
 * \brief   Clear ADC FIFO.
 *
 * \param[in] ADCx  Specify ADC peripheral.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void adc_demo(void)
 * {
 *     ADC_ClearFIFO(ADC);
 * }
 * \endcode
 */
void ADC_ClearFIFO(ADC_TypeDef *ADCx);

/**
 * \brief   Get all adc interrupt flag status.
 *
 * \param[in] ADCx  Specify ADC peripheral.
 *
 * \return  All ADC interrupt status.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void adc_demo(void)
 * {
 *     uint8_t all_flag_status = 0;
 *     all_flag_status = ADC_GetAllFlagStatus(ADC);
 * }
 * \endcode
 *
 */
uint8_t ADC_GetAllFlagStatus(ADC_TypeDef *ADCx);

/**
 * \brief  Get the index state of ADC controller.
 *
 * \param[in]  ADCx  Specify ADC peripheral.
 *
 * \return BIT[15:0] stores the data in the FIFO, BIT[31:28] stores the index of the data.
 */
uint32_t ADC_ReadScheduleIndexandFifoData(ADC_TypeDef *ADCx);

#if (ADC_SUPPORT_RAP_FUNCTION == 1)

void ADC_RAPModeCmd(ADC_TypeDef *ADCx, FunctionalState NewState);

void ADC_RAPQactiveCtrl(ADC_TypeDef *ADCx, uint32_t Qactive, FunctionalState NewState);

void ADC_TaskTrigger(ADC_TypeDef *ADCx, uint32_t Task);

#endif

/** End of ADC_Exported_Functions
  * \}
  */

/** End of ADC
  * \}
  */

#ifdef __cplusplus
}
#endif

#endif /* RTL_ADC_H */
